cập nhật lại date-change simple v1
